Revit 2027 API
FabricationConfiguration.GetSpecificationName Method
 Gets the specification name from its identifier.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetSpecificationName(
	int specId
)
Public Function GetSpecificationName (
	specId As Integer
) As String
public:
String^ GetSpecificationName(
	int specId
)
member GetSpecificationName :
        specId : int -> string
Parameters
specId Int32
 The specification identifier.
Return Value
String
 The specification name;
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace